Repository: huixiangyang/arc-kit
Catalog: Sources/Features/Finder/Extension/Resources/Localization/FinderExtension.xcstrings
Source language: en
Languages: zh_hans

# action.action.produced.agent.command.missing
source: The action produced no Agent command
zh_hans: 动作没有生成 Agent 命令

# action.arcKit.context.menu.notReady
source: Arc Kit context menu not ready
zh_hans: Arc Kit 右键菜单未就绪

# action.batchRenameFailed
source: Cannot batch rename
zh_hans: 无法批量重命名

# action.compressFilesFailed
source: Cannot compress files
zh_hans: 无法压缩文件

# action.convertImageFailed
source: Cannot convert image
zh_hans: 无法转换图片

# action.copyChecksumFailed
source: Cannot copy checksum
zh_hans: 无法复制哈希

# action.copyFailed
source: Cannot copy
zh_hans: 无法复制

# action.copyFileInformationFailed
source: Cannot copy file information
zh_hans: 无法复制文件信息

# action.copyFilenameFailed
source: Cannot copy filename
zh_hans: 无法复制文件名

# action.copyPathFailed
source: Cannot copy path
zh_hans: 无法复制路径

# action.createFileFailed
source: Cannot create file
zh_hans: 无法新建文件

# action.deletePermanentlyFailed
source: Cannot delete permanently
zh_hans: 无法彻底删除

# action.extractIconFailed
source: Cannot extract icon
zh_hans: 无法提取图标

# action.finder.action.unavailable
source: Finder action unavailable
zh_hans: Finder 动作不可用

# action.flattenFolderFailed
source: Cannot flatten folder
zh_hans: 无法解除文件夹

# action.folder.name.input.cancelled.user
source: Folder name input cancelled by user
zh_hans: 用户取消输入文件夹名称

# action.hideOtherFilesFailed
source: Cannot hide other files
zh_hans: 无法隐藏其他文件

# action.hideUnhideFilesFailed
source: Cannot hide or unhide files
zh_hans: 无法隐藏/取消隐藏文件

# action.lockUnlockFilesFailed
source: Cannot lock or unlock files
zh_hans: 无法锁定/解锁文件

# action.macos.hidden.files
source: macOS Hidden Files
zh_hans: macOS 隐藏文件

# action.menu.configuration.notReady
source: Menu configuration not ready
zh_hans: 菜单配置尚未就绪

# action.menu.expired.reopen.context.menu
source: This menu expired. Reopen the context menu and try again.
zh_hans: 该菜单已失效，请重新打开右键菜单后再试。

# action.moveFailed
source: Cannot move
zh_hans: 无法移动

# action.moveFolderFailed
source: Cannot move into folder
zh_hans: 无法移入文件夹

# action.open.arcKit.menuBar
source: Open Arc Kit from the menu bar or Applications, then run diagnostics or repair in Finder settings. The Finder extension does not launch the main app from context menu actions, avoiding unexpected windows or extra permission prompts.
zh_hans: 请从菜单栏或“应用程序”打开 Arc Kit，进入「右键管理」执行健康检查或一键修复。 Finder 扩展不会从右键动作里启动主 App，以避免误弹主窗口或触发额外隐私授权。

# action.openAppFailed
source: Cannot open app
zh_hans: 无法打开 App

# action.openPathFailed
source: Cannot open path
zh_hans: 无法打开路径

# action.openTerminalFailed
source: Cannot open terminal
zh_hans: 无法打开终端

# action.operation.cancelled.user
source: Operation cancelled by user
zh_hans: 用户取消操作

# action.permanent.deletion.cancelled.user
source: Permanent deletion cancelled by user
zh_hans: 用户取消彻底删除

# action.pickColorFailed
source: Cannot pick color
zh_hans: 无法拾取颜色

# action.press.command.shift.finder.toggle
source: Press ⌘⇧. (Command+Shift+.) in Finder to toggle hidden files. You can also control hidden files in Arc Kit's General settings.
zh_hans: 在 Finder 中按 ⌘⇧. (Command+Shift+.) 可以快速切换隐藏文件显示。 你也可以在 Arc Kit「系统」页面中通过「切换隐藏文件」按钮控制。

# action.reopen.context.menu.retry
source: Reopen the context menu and try again.
zh_hans: 请重新打开右键菜单后再试。

# action.restoreFolderIconFailed
source: Cannot restore folder icon
zh_hans: 无法还原文件夹图标

# action.runScriptFailed
source: Cannot run script
zh_hans: 无法执行脚本

# action.script.selection.cancelled.user
source: Script selection cancelled by user
zh_hans: 用户取消选择脚本

# action.setFolderIconFailed
source: Cannot set folder icon
zh_hans: 无法设置文件夹图标

# action.showInstructionsFailed
source: Cannot show instructions
zh_hans: 无法显示说明

# action.showRecoveryInstructionsFailed
source: Cannot show recovery instructions
zh_hans: 无法显示恢复说明

# action.trusted.menu.configuration.received.yet.missing
source: No trusted menu configuration received yet
zh_hans: 尚未收到可信菜单配置

# command.batch.rename
source: Batch Rename
zh_hans: 批量重命名

# command.compress.files
source: Compress Files
zh_hans: 压缩文件

# command.convert.image
source: Convert Image
zh_hans: 转换图片

# command.copy.checksum
source: Copy Checksum
zh_hans: 复制哈希

# command.extract.icon
source: Extract Icon
zh_hans: 提取图标

# command.finder.action.failed
source: Finder action failed
zh_hans: Finder 动作失败

# command.flatten.folder
source: Flatten Folder
zh_hans: 解除文件夹

# command.groupInFolder
source: Move into Folder
zh_hans: 移入文件夹

# command.hide.other.files
source: Hide Other Files
zh_hans: 隐藏其他文件

# command.pick.color
source: Pick Color
zh_hans: 拾取颜色

# command.restore.folder.icon
source: Restore Folder Icon
zh_hans: 还原文件夹图标

# command.run.script
source: Run Script
zh_hans: 执行脚本

# command.set.folder.icon
source: Set Folder Icon
zh_hans: 设置文件夹图标

# extension.applicable.menu.items.check.arcKit.missing
source: No applicable menu items. Check Arc Kit settings.
zh_hans: 没有适用的菜单项目，请检查 Arc Kit 设置

# extension.arcKit.file.actions
source: Arc Kit File Actions
zh_hans: Arc Kit 文件操作

# extension.finder.off
source: Finder is off
zh_hans: Finder 功能已关闭

# extension.finder.provided.target.select.file.missing
source: Finder provided no target. Select a file or folder.
zh_hans: Finder 未提供目标，请选择文件或文件夹

# extension.menu.notReady.retry.later
source: Menu not ready. Try again later.
zh_hans: 菜单尚未就绪，请稍后重试

# extension.menu.registration.expired.tag
source: Menu registration expired (tag=%1$@)
zh_hans: 菜单登记已失效（tag=%1$@）

# ipc.request.timeout
source: Request timed out
zh_hans: 请求超时

# ipc.unknown.xpc.error
source: Unknown XPC error
zh_hans: 未知 XPC 错误

# menu.delete.permanently
source: Delete Permanently
zh_hans: 彻底删除

# menu.hide.other.items.same.folder
source: Hide other items in the same folder
zh_hans: 隐藏同目录其他项目

# menu.unhide.files
source: Unhide Files
zh_hans: 取消隐藏文件

# prompt.choose.script.run
source: Choose a Script to Run
zh_hans: 选择要执行的脚本文件

# prompt.enter.new.folder.name
source: Enter a new folder name:
zh_hans: 输入新文件夹名称：

# prompt.new.folder
source: New Folder
zh_hans: 新文件夹

# prompt.permanentDeletionHint
source: This bypasses Trash and cannot be undone.
zh_hans: 此操作会绕过废纸篓，无法撤销。

# prompt.permanently.delete.selected.files
source: Permanently delete the selected files?
zh_hans: 确认彻底删除所选文件？

# prompt.scriptPickerFailed
source: Cannot open script picker
zh_hans: 无法打开脚本选择器

# prompt.scriptTypesUnavailable
source: The system did not provide Shell, Python or JavaScript file types.
zh_hans: 系统没有提供 Shell、Python 或 JavaScript 文件类型。

# queue.identityMismatch
source: Agent identity does not match the installation path
zh_hans: Agent 自报身份与安装路径不一致

# queue.noResponse
source: Finder Agent did not respond
zh_hans: Finder Agent 未响应

# queue.notAcknowledged
source: Command %1$@ was not acknowledged by the installed Agent. %2$@ Run diagnostics or repair from Arc Kit's Finder settings.
zh_hans: 命令 %1$@ 未被当前安装的 Agent 确认。%2$@ 请在 Arc Kit「右键管理」中执行健康检查或一键修复。

# queue.timeout
source: Timed out after 2 seconds.
zh_hans: 等待 2 秒后超时。

# request.action.supports.one.item.select
source: This action supports one item only. Select again.
zh_hans: 此操作只支持一个项目，请重新选择。

# request.confirmationRequired
source: Cannot perform %1$@: user confirmation is missing.
zh_hans: 无法%1$@：缺少用户确认。

# request.copy.destination.folder
source: Copy destination folder
zh_hans: 复制目标目录

# request.finder.provided.target.menu.missing
source: Finder provided no target for this menu. Close it, select a file or folder, then retry.
zh_hans: Finder 未提供本次菜单的目标，请关闭菜单并选择文件或文件夹后重试。

# request.folder.name
source: Folder name
zh_hans: 文件夹名称

# request.folderSelectionRequired
source: Cannot perform %1$@: select one or more folders and retry.
zh_hans: 无法%1$@：请选中一个或多个文件夹后重试。

# request.hide.files
source: Hide Files
zh_hans: 隐藏文件

# request.highRiskDisabled
source: Cannot perform %1$@: high-risk actions are disabled.
zh_hans: 无法%1$@：高危操作开关未开启。

# request.incomplete.menu.action.parameters
source: Incomplete menu action parameters: %1$@
zh_hans: 菜单动作参数不完整：%1$@

# request.lock.files
source: Lock Files
zh_hans: 锁定文件

# request.lock.unlock
source: Lock / Unlock
zh_hans: 锁定/解锁

# request.move.destination.folder
source: Move destination folder
zh_hans: 移动目标目录

# request.required.input.missing
source: Required input missing: %1$@
zh_hans: 缺少必要输入：%1$@

# request.script.path
source: Script path
zh_hans: 脚本路径

# request.selectionMissing
source: Cannot perform %1$@: no actionable Finder selection.
zh_hans: 无法%1$@：没有可操作的 Finder 选中项。

# request.unlock.files
source: Unlock Files
zh_hans: 解锁文件

# transfer.copy
source: Copy
zh_hans: 复制

# transfer.got
source: Got It
zh_hans: 知道了

# transfer.move
source: Move
zh_hans: 移动
